/* Prints int and float values in various formats */

#include <stdio.h>

int main(void)
{
    // 声明
    int i;
    float x;

    // 赋值
    i = 40;
    x = 839.21f;

    // 识别格式串
    //40,   40,40   ,  040,
    printf("|%d|%5d|%-5d|%5.3d|\n",i,i,i,i);
    //  839.210, 8.392e+02,839.21     ,
    printf("|%10.3f|%10.3e|%-10g|\n",x,x,x);

    return 0;
}
/*
%d 十进制整数
%5d 右对齐，最少5个有效字符
%-5d 左对齐，最少5个有效字符
%5.3d 右对齐，最少5个有效字符，3个有效数字
%10.3f 右对齐，定点十进制浮点数，至少10个有效字符，小数点后3个有效数字
%10.3e 右对齐，指数浮点数，至少10个有效字符，小数点后3位有效数字
%-10g 左对齐，至少10个有效字符，定点十进制浮点数
*/